# NurbsCurveGetNumPieces

## Description
Returns the number of pieces that compose the referenced NURBS curve.

```pascal
FUNCTION NurbsCurveGetNumPieces(objectHd : HANDLE): INTEGER;
```

```python
def vs.NurbsCurveGetNumPieces(objectHd):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHd|HANDLE|Handle to NURBS curve.|

## Remarks
See example on NurbsGetPt3D

## Examples
presentation of pieces (segments in the example) in a NURBS curve:

```pascal
resultN := NurbsCurveGetNumPieces(objectHd);
```
```python
import vs

# Returns the number of pieces that compose the referenced NURBS curve.
objectHd = vs.FSActLayer()  # handle to the first selected object on the active layer

count = vs.NurbsCurveGetNumPieces(objectHd)
vs.Message('NurbsCurveGetNumPieces returned: ' + str(count))
```

## Version
Availability: from VectorWorks 9.0

## Category
* Objects - NURBS